АлогистикТест2/src/Documents/рфп_ОтгрузкаВагона/рфп_ОтгрузкаВагона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рфп_ОтгрузкаВагона</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНесортированного</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>НомерВагона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>_Производитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыВходящейОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазгруженСобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>_Пиловочник</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пиловочник</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>_Порода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>_Сорт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>_Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеНастройки/алк_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперацииПроизводства</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Остатки</name>
  </enumValues>
  <enumValues>
    <name>Произведено</name>
  </enumValues>
  <enumValues>
    <name>Подано</name>
  </enumValues>
  <enumValues>
    <name>Получено</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Упаковано</name>
    <comment>Упаковано объема</comment>
  </enumValues>
  <enumValues>
    <name>Выход</name>
  </enumValues>
  <enumValues>
    <name>УпакованоШтук</name>
    <comment>Упаковано штук пакетов</comment>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование1</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование2</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование3</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеНаКотельную</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырья</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЕль</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЛиственница</name>
  </enumValues>
  <enumValues>
    <name>КРСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>КРСОбщий</name>
  </enumValues>
  <enumValues>
    <name>ОстатокВСилосе</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяВсего</name>
  </enumValues>
  <enumValues>
    <name>ГранулированиеСреднее</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКора</name>
  </enumValues>
  <enumValues>
    <name>ПоступилоНаБиржу</name>
    <comment>ВходящийТранспорт. Привезли еще не разгружался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСобственнымиСилами</name>
    <comment>ВходящийТранспортРазгрузили еще не сортировался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСиламиПодрядчика</name>
  </enumValues>
  <enumValues>
    <name>ПолученоСырьяПослеДробления</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_СтатусыВходящейОтгрузки/алк_СтатусыВходящейОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СтатусыВходящейОтгрузки</name>
  <enumValues>
    <name>ВПути</name>
    <comment>Выехал с пункта отправления</comment>
  </enumValues>
  <enumValues>
    <name>Прибыл</name>
    <comment>Транспорт приехал на АЛК</comment>
  </enumValues>
  <enumValues>
    <name>Разгружен</name>
    <comment>Разгрузиди несортированную</comment>
  </enumValues>
  <enumValues>
    <name>Принят</name>
    <comment>Оформлен акт приемки</comment>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/ФиксированныеДопРеквизиты/ФиксированныеДопРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФиксированныеДопРеквизиты</name>
  <enumValues>
    <name>Порода</name>
  </enumValues>
  <enumValues>
    <name>Сорт</name>
  </enumValues>
  <enumValues>
    <name>Длина</name>
  </enumValues>
  <enumValues>
    <name>Сечение</name>
  </enumValues>
  <enumValues>
    <name>Влажность</name>
  </enumValues>
  <enumValues>
    <name>Поверхность</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/рфп_ОтгрузкаВагона/ManagerModule.bsl
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#Область ИнициализацияДаных

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ПодобратьХарактеристику(ДокументСсылка); 
	СформироватьДвиженияОстаткиНесортированного(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьДвиженияОборотыПроизводства(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьДвиженияПроизводствоОборот(ДокументСсылка, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура СформироватьДвиженияОборотыПроизводства(ДокументСсылка, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки КАК Период,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	СУММА(рфп_ОтгрузкаВагонаПиловочник.Объем) КАК Объем,
	|	ВЫБОР
	|		КОГДА рфп_ОтгрузкаВагонаПиловочник.Ссылка.РазгруженСобственнымиСилами
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСобственнымиСилами)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСиламиПодрядчика)
	|	КОНЕЦ КАК Операция
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И 1 В
	|			(ВЫБРАТЬ
	|				1 КАК Поле1
	|			ИЗ
	|				РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаНесортированных"") КАК алк_ДополнительныеНастройкиСрезПоследних
	|			ГДЕ
	|				алк_ДополнительныеНастройкиСрезПоследних.Дата <= &Период)
	|	И НЕ рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки = &ПустаяДата
	|	И рфп_ОтгрузкаВагонаПиловочник.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.алк_СтатусыВходящейОтгрузки.Разгружен), ЗНАЧЕНИЕ(Перечисление.алк_СтатусыВходящейОтгрузки.Принят))
	|
	|СГРУППИРОВАТЬ ПО
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА рфп_ОтгрузкаВагонаПиловочник.Ссылка.РазгруженСобственнымиСилами
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСобственнымиСилами)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСиламиПодрядчика)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	СУММА(рфп_ОтгрузкаВагонаПиловочник.Объем),
	|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.ПоступилоНаБиржу)
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И 1 В
	|			(ВЫБРАТЬ
	|				1 КАК Поле1
	|			ИЗ
	|				РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаНесортированных"") КАК алк_ДополнительныеНастройкиСрезПоследних
	|			ГДЕ
	|				алк_ДополнительныеНастройкиСрезПоследних.Дата <= &Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);  
	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	
	МассивРезультатов = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", МассивРезультатов.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьДвиженияОстаткиНесортированного(ДокументСсылка, СтруктураДополнительныеСвойства);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия КАК Период,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Склад КАК СтруктурнаяЕдиница,
	|	рфп_ОтгрузкаВагонаПиловочник.Порода,
	|	СУММА(рфп_ОтгрузкаВагонаПиловочник.Объем) КАК Объем,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА рфп_ОтгрузкаВагонаПиловочник.Ссылка.Дата > &ДатаЗапрета
	|			ТОГДА рфп_ОтгрузкаВагонаПиловочник.Длина
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)
	|	КОНЕЦ КАК Длина,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка КАК Партия
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И НЕ рфп_ОтгрузкаВагонаПиловочник.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.алк_статусыВходящейОтгрузки.ВПути)
	|
	|СГРУППИРОВАТЬ ПО
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Склад,
	|	рфп_ОтгрузкаВагонаПиловочник.Порода,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка,
	|	ВЫБОР
	|		КОГДА рфп_ОтгрузкаВагонаПиловочник.Ссылка.Дата > &ДатаЗапрета
	|			ТОГДА рфп_ОтгрузкаВагонаПиловочник.Длина
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)
	|	КОНЕЦ";
	//"ВЫБРАТЬ
	//|	алк_ВходящийТранспорт.Дата КАК Период,
	//|	&ВидДвиженияПриход КАК ВидДвижения,
	//|	алк_ВходящийТранспорт.Организация,
	//|	алк_ВходящийТранспорт.СтруктурнаяЕдиница,
	//|	алк_ВходящийТранспорт.Порода,
	//|	алк_ВходящийТранспорт.НомерВагонаВРег Как НомерВагона,
	//|	алк_ВходящийТранспорт.НомерНакладнойВРег Как НомерНакладной,
	//|	алк_ВходящийТранспорт.Объем
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Документ.алк_ВходящийТранспорт КАК алк_ВходящийТранспорт
	//|ГДЕ
	//|	алк_ВходящийТранспорт.Ссылка = &Ссылка
	//|	И 1 В
	//|			(ВЫБРАТЬ
	//|				1 КАК Поле1
	//|			ИЗ
	//|				РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаНесортированных"") КАК алк_ДополнительныеНастройкиСрезПоследних
	//|			ГДЕ
	//|				алк_ДополнительныеНастройкиСрезПоследних.Дата <= &Период)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ОстаткиНесортированного.Регистратор,
	//|	алк_ОстаткиНесортированного.НомерНакладной,
	//|	алк_ОстаткиНесортированного.Объем
	//|ПОМЕСТИТЬ ВТ_Движения
	//|ИЗ
	//|	РегистрНакопления.алк_ОстаткиНесортированного КАК алк_ОстаткиНесортированного
	//|ГДЕ
	//|	алк_ОстаткиНесортированного.Регистратор = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ.Период,
	//|	ВТ.ВидДвижения,
	//|	ВТ.Организация,
	//|	ВТ.СтруктурнаяЕдиница,
	//|	ВТ.Порода,
	//|	ВТ.НомерВагона,
	//|	ВТ.НомерНакладной,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ВТ_Движения.Объем, 0) = 0
	//|			ТОГДА ВЫБОР
	//|					КОГДА ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.ОбъемОстаток, 0) = 0
	//|						ТОГДА ВТ.Объем
	//|					ИНАЧЕ -алк_ОстаткиНесортированногоОстатки.ОбъемОстаток
	//|				КОНЕЦ
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.ОбъемОстаток, 0) = 0
	//|					ТОГДА ВТ_Движения.Объем
	//|				ИНАЧЕ ВТ.Объем
	//|			КОНЕЦ
	//|	КОНЕЦ КАК Объем
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиНесортированного.Остатки(
	//|				,
	//|				(НомерВагона, НомерНакладной, Организация, Порода, СтруктурнаяЕдиница) В
	//|					(ВЫБРАТЬ
	//|						ВТ.НомерВагона,
	//|						ВТ.НомерНакладной,
	//|						ВТ.Организация,
	//|						ВТ.Порода,
	//|						ВТ.СтруктурнаяЕдиница
	//|					ИЗ
	//|						ВТ КАК ВТ)) КАК алк_ОстаткиНесортированногоОстатки
	//|		ПО ВТ.НомерНакладной = алк_ОстаткиНесортированногоОстатки.НомерНакладной
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Движения КАК ВТ_Движения
	//|		ПО ВТ.НомерНакладной = ВТ_Движения.НомерНакладной";
	
	//Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	//Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);  
	//Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
	
	Запрос.УстановитьПараметр("ДатаЗапрета", '20240723'); //добавили длину, чтобы выводить в Оперсводках Данько Т. А. 24.07.2024Г.  
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНесортированного", МассивРезультатов[0].Выгрузить());
	
КонецПроцедуры

Процедура СформироватьДвиженияПроизводствоОборот(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	//определяем смену для даты прибытия и даты разгрузки
	ДатаПрибытия = ДокументСсылка.ДатаПрибытия;
	
	ДатаРазгрузки = ДокументСсылка.ДатаРазгрузки; 
	
	Участок =  ДокументСсылка.Участок; 
	
	Если ДатаПрибытия = Дата(1,1,1) Тогда  
		ДатаСменыПрибытия = Дата(1,1,1); 
		СменаПрибытия = Справочники.алк_Смены.ПустаяСсылка(); 
	Иначе      
		ПараметрыСменыПрибытия = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Участок, ДатаПрибытия); 
		ДатаСменыПрибытия = ПараметрыСменыПрибытия.ДатаСмены; 
		СменаПрибытия = ПараметрыСменыПрибытия.Смена;
	КонецЕсли;
	
	Если ДатаРазгрузки = Дата(1,1,1) Тогда 
		ДатаСменыРазгрузки = Дата(1,1,1); 
		СменаРазгрузки = Справочники.алк_Смены.ПустаяСсылка();
	Иначе  
		ПараметрыСменыРазгрузки = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Участок, ДатаРазгрузки); 
		ДатаСменыРазгрузки = ПараметрыСменыРазгрузки.ДатаСмены;
		СменаРазгрузки = ПараметрыСменыРазгрузки.Смена;
	КонецЕсли;
	//\\
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия КАК Период,
	|	&ДатаСменыПрибытия КАК ДатаСмены,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	рфп_ОтгрузкаВагонаПиловочник.Объем КАК Количество,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Прибыло) КАК Операция,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано) КАК ВидДвиженияПроизводства,
	|	рфп_ОтгрузкаВагонаПиловочник.Номенклатура,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Склад,
	|	алк_ПараметрыХарактеристик.Характеристика,
	|	&СменаПрибытия КАК Смена,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Участок
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО рфп_ОтгрузкаВагонаПиловочник.Порода = алк_ПараметрыХарактеристик.Порода
	|			И рфп_ОтгрузкаВагонаПиловочник.Сорт = алк_ПараметрыХарактеристик.Сорт
	|			И рфп_ОтгрузкаВагонаПиловочник.Длина = алк_ПараметрыХарактеристик.Длина
	|			И рфп_ОтгрузкаВагонаПиловочник.Сечение = алк_ПараметрыХарактеристик.Сечение
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И НЕ рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия = &ПустаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки,
	|	&ДатаСменыРазгрузки,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	рфп_ОтгрузкаВагонаПиловочник.Объем,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Разгружено),
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано),
	|	рфп_ОтгрузкаВагонаПиловочник.Номенклатура,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Склад,
	|	алк_ПараметрыХарактеристик.Характеристика,
	|	&СменаРазгрузки,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Участок
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО рфп_ОтгрузкаВагонаПиловочник.Порода = алк_ПараметрыХарактеристик.Порода
	|			И рфп_ОтгрузкаВагонаПиловочник.Сорт = алк_ПараметрыХарактеристик.Сорт
	|			И рфп_ОтгрузкаВагонаПиловочник.Длина = алк_ПараметрыХарактеристик.Длина
	|			И рфп_ОтгрузкаВагонаПиловочник.Сечение = алк_ПараметрыХарактеристик.Сечение
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И НЕ рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки = &ПустаяДата";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);  
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1)); 
	Запрос.УстановитьПараметр("СменаПрибытия", СменаПрибытия);
	Запрос.УстановитьПараметр("СменаРазгрузки",СменаРазгрузки);
	Запрос.УстановитьПараметр("ДатаСменыПрибытия", ДатаСменыПрибытия);
	Запрос.УстановитьПараметр("ДатаСменыРазгрузки",ДатаСменыРазгрузки);
				
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

Процедура УстановитьСтатусПартии(ДокументСсылка, НовыйСтатус, СобственнымиСилами=Ложь) Экспорт
	
	Если (НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен
		ИЛИ НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл)
		И ДобавитьМесяц(ДокументСсылка.Дата, 2) < ТекущаяДата() тогда
		Сообщить("Запрещено изменять статус документа "+ДокументСсылка+" с даты которого прошло более двух месяцев");
		Возврат;
	КонецЕсли;
	Попытка 
		Объект = ДокументСсылка.ПолучитьОбъект();
		Объект.ДополнительныеСвойства.Вставить("ТребуетсяКонтрольДатыЗапрета", Ложь);
		
		Если НовыйСтатус = Объект.Статус тогда
			Возврат;
		ИначеЕсли НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл И Не ЗначениеЗаполнено(Объект.ДатаПрибытия) тогда
			Объект.ДатаПрибытия = ТекущаяДата();
		ИначеЕсли НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен тогда
			Если Не ЗначениеЗаполнено(Объект.ДатаПрибытия) тогда
				Объект.ДатаПрибытия = ТекущаяДата();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Объект.ДатаРазгрузки) тогда
				Объект.ДатаРазгрузки = ТекущаяДата();
			КонецЕсли;
			Объект.РазгруженСобственнымиСилами = СобственнымиСилами;
		ИначеЕсли НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Принят 
			И не Объект.Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен тогда
			Сообщить("Входящая отгрузка должна находиться в статусе разгружен");
			Возврат;
		КонецЕсли;
		
		Объект.Статус = НовыйСтатус;
		
		Если Объект.ПометкаУдаления тогда
			Объект.ПометкаУдаления = Ложь;
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		ИначеЕсли НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Принят тогда
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();
		Иначе
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации(
			"УстановкаСтатусаРФП_ОтгрузкаВагона", 
			УровеньЖурналаРегистрации.Ошибка, , 
			Строка(ДокументСсылка), 
			СтрШаблон("Не удалось записать документ %1, при установке статуса %2. (Документы.рфп_ОтгрузкаВагона.ММ) %3", ДокументСсылка, НовыйСтатус, ОписаниеОшибки()));
	КонецпоПытки;
КонецПроцедуры

//создает хар-ку, если не найдена
Процедура ПодобратьХарактеристику(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	рфп_ОтгрузкаВагонаПиловочник.Номенклатура,
	               |	рфп_ОтгрузкаВагонаПиловочник.Порода,
	               |	рфп_ОтгрузкаВагонаПиловочник.Сорт,
	               |	рфп_ОтгрузкаВагонаПиловочник.Длина,
	               |	рфп_ОтгрузкаВагонаПиловочник.Сечение
	               |ИЗ
	               |	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО рфп_ОтгрузкаВагонаПиловочник.Порода = алк_ПараметрыХарактеристик.Порода
	               |			И рфп_ОтгрузкаВагонаПиловочник.Сорт = алк_ПараметрыХарактеристик.Сорт
	               |			И рфп_ОтгрузкаВагонаПиловочник.Длина = алк_ПараметрыХарактеристик.Длина
	               |			И рфп_ОтгрузкаВагонаПиловочник.Сечение = алк_ПараметрыХарактеристик.Сечение
	               |ГДЕ
	               |	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	               |	И алк_ПараметрыХарактеристик.Характеристика ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	               |	рфп_ОтгрузкаВагонаПиловочник.Номенклатура,
	               |	рфп_ОтгрузкаВагонаПиловочник.Порода,
	               |	рфп_ОтгрузкаВагонаПиловочник.Сорт,
	               |	рфп_ОтгрузкаВагонаПиловочник.Длина,
	               |	рфп_ОтгрузкаВагонаПиловочник.Сечение";
	Запрос.УстановитьПараметр("Ссылка",Ссылка); 
	РезЗ = Запрос.Выполнить();
	Если РезЗ.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = РезЗ.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ТаблицаСвойствИЗначений = Новый ТаблицаЗначений;
		ТаблицаСвойствИЗначений.Колонки.Добавить("Свойство");
		ТаблицаСвойствИЗначений.Колонки.Добавить("Значение");
		
		НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
		НоваяСтрокаСвойств.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода);
		НоваяСтрокаСвойств.Значение = Выборка.Порода; 
		
		Если Выборка.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002") Тогда  
			НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
			НоваяСтрокаСвойств.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт);
			НоваяСтрокаСвойств.Значение = Выборка.Сорт; 
		КонецЕсли;
		
		НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
		НоваяСтрокаСвойств.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина);
		НоваяСтрокаСвойств.Значение = Выборка.Длина;
		
		НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
		НоваяСтрокаСвойств.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение);
		НоваяСтрокаСвойств.Значение = Выборка.Сечение;
		
		Попытка
			АлгоритмыСвойстваИХарактеристики.СоздатьХарактеристикуПоНаборуСвойств(Выборка.Номенклатура, ТаблицаСвойствИЗначений);  
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка при создании характеристики!",,,,ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры
